; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v7 ?v11)
             (pred_1 ?v13 ?v1)
             (pred_8 ?v7 ?v1)
             (pred_10 ?v9 ?v7 )
	     (pred_6 ?v7)
             (pred_3 ?v2)
             (pred_12 ?v13)
             (pred_4 ?v1)
             (pred_7 ?v7)
             (pred_11 ?v13)
             (pred_2 ?v7)
             (pred_5 ))



(:action op_1
:parameters (?v5 ?v12 ?v8 ?v3)
:precondition (and (pred_3 ?v5) (pred_3 ?v12) (pred_12 ?v8) (pred_4 ?v3)
          (pred_9 ?v5 ?v12) (pred_1 ?v8 ?v3)
                   (pred_8 ?v12 ?v3) (pred_6 ?v5) 
                   (pred_7 ?v12) (pred_11 ?v8))
:effect (and  (pred_2 ?v12) (not (pred_7 ?v12))))


(:action op_5
:parameters (?v5 ?v4)
:precondition (and (pred_3 ?v5) (pred_3 ?v4)
               (pred_6 ?v5) (pred_9 ?v5 ?v4) (pred_2 ?v4))
:effect (and (pred_6 ?v4) (not (pred_6 ?v5))))

(:action op_4
:parameters (?v5 ?v8)
:precondition (and (pred_3 ?v5) (pred_12 ?v8) 
                  (pred_6 ?v5) (pred_10 ?v8 ?v5) (pred_5 ))
:effect (and (pred_11 ?v8)
   (not (pred_10 ?v8 ?v5)) (not (pred_5 ))))


(:action op_2
:parameters (?v5 ?v10 ?v6)
:precondition (and (pred_3 ?v5) (pred_12 ?v10) (pred_12 ?v6)
                  (pred_6 ?v5) (pred_11 ?v6) (pred_10 ?v10 ?v5))
:effect (and (pred_11 ?v10) (pred_10 ?v6 ?v5)
        (not (pred_11 ?v6)) (not (pred_10 ?v10 ?v5))))

(:action op_3
:parameters (?v5 ?v8)
:precondition (and (pred_3 ?v5) (pred_12 ?v8) 
                  (pred_6 ?v5) (pred_11 ?v8))
:effect (and (pred_5 ) (pred_10 ?v8 ?v5) (not (pred_11 ?v8)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_08 obj_01 obj_15 obj_16 obj_13 obj_28 obj_26 obj_06 obj_18 obj_25 obj_19 obj_03 obj_05 obj_02 obj_30 obj_22 obj_09 obj_17 obj_21 obj_20 obj_27 obj_07 obj_04 obj_23 obj_24
    obj_11 obj_10
    obj_12 obj_29 obj_14
    )

    (:init
       (pred_5)

       (pred_3 obj_08)
       (pred_3 obj_01)
       (pred_3 obj_15)
       (pred_3 obj_16)
       (pred_3 obj_13)
       (pred_3 obj_28)
       (pred_3 obj_26)
       (pred_3 obj_06)
       (pred_3 obj_18)
       (pred_3 obj_25)
       (pred_3 obj_19)
       (pred_3 obj_03)
       (pred_3 obj_05)
       (pred_3 obj_02)
       (pred_3 obj_30)
       (pred_3 obj_22)
       (pred_3 obj_09)
       (pred_3 obj_17)
       (pred_3 obj_21)
       (pred_3 obj_20)
       (pred_3 obj_27)
       (pred_3 obj_07)
       (pred_3 obj_04)
       (pred_3 obj_23)
       (pred_3 obj_24)
       (pred_4 obj_11)
       (pred_4 obj_10)
       (pred_12 obj_12)
       (pred_12 obj_29)
       (pred_12 obj_14)

       (pred_9 obj_08 obj_28)
       (pred_9 obj_08 obj_01)
       (pred_9 obj_01 obj_26)
       (pred_9 obj_01 obj_15)
       (pred_9 obj_01 obj_08)
       (pred_9 obj_15 obj_06)
       (pred_9 obj_15 obj_16)
       (pred_9 obj_15 obj_01)
       (pred_9 obj_16 obj_18)
       (pred_9 obj_16 obj_13)
       (pred_9 obj_16 obj_15)
       (pred_9 obj_13 obj_25)
       (pred_9 obj_13 obj_16)
       (pred_9 obj_28 obj_19)
       (pred_9 obj_28 obj_26)
       (pred_9 obj_28 obj_08)
       (pred_9 obj_26 obj_03)
       (pred_9 obj_26 obj_06)
       (pred_9 obj_26 obj_01)
       (pred_9 obj_26 obj_28)
       (pred_9 obj_06 obj_05)
       (pred_9 obj_06 obj_18)
       (pred_9 obj_06 obj_15)
       (pred_9 obj_06 obj_26)
       (pred_9 obj_18 obj_02)
       (pred_9 obj_18 obj_25)
       (pred_9 obj_18 obj_16)
       (pred_9 obj_18 obj_06)
       (pred_9 obj_25 obj_30)
       (pred_9 obj_25 obj_13)
       (pred_9 obj_25 obj_18)
       (pred_9 obj_19 obj_22)
       (pred_9 obj_19 obj_03)
       (pred_9 obj_19 obj_28)
       (pred_9 obj_03 obj_09)
       (pred_9 obj_03 obj_05)
       (pred_9 obj_03 obj_26)
       (pred_9 obj_03 obj_19)
       (pred_9 obj_05 obj_17)
       (pred_9 obj_05 obj_02)
       (pred_9 obj_05 obj_06)
       (pred_9 obj_05 obj_03)
       (pred_9 obj_02 obj_21)
       (pred_9 obj_02 obj_30)
       (pred_9 obj_02 obj_18)
       (pred_9 obj_02 obj_05)
       (pred_9 obj_30 obj_20)
       (pred_9 obj_30 obj_25)
       (pred_9 obj_30 obj_02)
       (pred_9 obj_22 obj_27)
       (pred_9 obj_22 obj_09)
       (pred_9 obj_22 obj_19)
       (pred_9 obj_09 obj_07)
       (pred_9 obj_09 obj_17)
       (pred_9 obj_09 obj_03)
       (pred_9 obj_09 obj_22)
       (pred_9 obj_17 obj_04)
       (pred_9 obj_17 obj_21)
       (pred_9 obj_17 obj_05)
       (pred_9 obj_17 obj_09)
       (pred_9 obj_21 obj_23)
       (pred_9 obj_21 obj_20)
       (pred_9 obj_21 obj_02)
       (pred_9 obj_21 obj_17)
       (pred_9 obj_20 obj_24)
       (pred_9 obj_20 obj_30)
       (pred_9 obj_20 obj_21)
       (pred_9 obj_27 obj_07)
       (pred_9 obj_27 obj_22)
       (pred_9 obj_07 obj_04)
       (pred_9 obj_07 obj_09)
       (pred_9 obj_07 obj_27)
       (pred_9 obj_04 obj_23)
       (pred_9 obj_04 obj_17)
       (pred_9 obj_04 obj_07)
       (pred_9 obj_23 obj_24)
       (pred_9 obj_23 obj_21)
       (pred_9 obj_23 obj_04)
       (pred_9 obj_24 obj_20)
       (pred_9 obj_24 obj_23)
       (pred_7 obj_16)
       (pred_7 obj_07)
       (pred_7 obj_24)
       (pred_8  obj_16 obj_11)
       (pred_8  obj_07 obj_10)
       (pred_8  obj_24 obj_10)
       (pred_2 obj_08)
       (pred_2 obj_01)
       (pred_2 obj_15)
       (pred_2 obj_13)
       (pred_2 obj_28)
       (pred_2 obj_26)
       (pred_2 obj_06)
       (pred_2 obj_18)
       (pred_2 obj_25)
       (pred_2 obj_19)
       (pred_2 obj_03)
       (pred_2 obj_05)
       (pred_2 obj_02)
       (pred_2 obj_30)
       (pred_2 obj_22)
       (pred_2 obj_09)
       (pred_2 obj_17)
       (pred_2 obj_21)
       (pred_2 obj_20)
       (pred_2 obj_27)
       (pred_2 obj_04)
       (pred_2 obj_23)

       (pred_1  obj_12 obj_11)
       (pred_1  obj_29 obj_10)
       (pred_1  obj_14 obj_10)
       (pred_10 obj_12 obj_13)
       (pred_10 obj_29 obj_20)
       (pred_10 obj_14 obj_03)
       (pred_6 obj_19)
    )

    (:goal (and
       (pred_10 obj_12 obj_06)
    ))
(:constraints
  (always (not (pred_6 obj_18)))
)
)

; plan
1. (op_5 obj_19 obj_03)
   deleted: (pred_6 obj_19)
   added: (pred_6 obj_03)
   goals met: 0 of 1
2. (op_4 obj_03 obj_14)
   deleted: (pred_10 obj_14 obj_03) (pred_5)
   added: (pred_11 obj_14)
   goals met: 0 of 1
3. (op_5 obj_03 obj_26)
   deleted: (pred_6 obj_03)
   added: (pred_6 obj_26)
   goals met: 0 of 1
4. (op_5 obj_26 obj_06)
   deleted: (pred_6 obj_26)
   added: (pred_6 obj_06)
   goals met: 0 of 1
5. (op_3 obj_06 obj_14)
   deleted: (pred_11 obj_14)
   added: (pred_5) (pred_10 obj_14 obj_06)
   goals met: 0 of 1
6. (op_5 obj_06 obj_05)
   deleted: (pred_6 obj_06)
   added: (pred_6 obj_05)
   goals met: 0 of 1
7. (op_5 obj_05 obj_02)
   deleted: (pred_6 obj_05)
   added: (pred_6 obj_02)
   goals met: 0 of 1
8. (op_5 obj_02 obj_30)
   deleted: (pred_6 obj_02)
   added: (pred_6 obj_30)
   goals met: 0 of 1
9. (op_5 obj_30 obj_25)
   deleted: (pred_6 obj_30)
   added: (pred_6 obj_25)
   goals met: 0 of 1
10. (op_5 obj_25 obj_13)
   deleted: (pred_6 obj_25)
   added: (pred_6 obj_13)
   goals met: 0 of 1
11. (op_4 obj_13 obj_12)
   deleted: (pred_10 obj_12 obj_13) (pred_5)
   added: (pred_11 obj_12)
   goals met: 0 of 1
12. (op_1 obj_13 obj_16 obj_12 obj_11)
   deleted: (pred_7 obj_16)
   added: (pred_2 obj_16)
   goals met: 0 of 1
13. (op_5 obj_13 obj_16)
   deleted: (pred_6 obj_13)
   added: (pred_6 obj_16)
   goals met: 0 of 1
14. (op_5 obj_16 obj_15)
   deleted: (pred_6 obj_16)
   added: (pred_6 obj_15)
   goals met: 0 of 1
15. (op_5 obj_15 obj_06)
   deleted: (pred_6 obj_15)
   added: (pred_6 obj_06)
   goals met: 0 of 1
16. (op_2 obj_06 obj_14 obj_12)
   deleted: (pred_11 obj_12) (pred_10 obj_14 obj_06)
   added: (pred_11 obj_14) (pred_10 obj_12 obj_06)
   goals met: 1 of 1
